app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "name", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["content", "Comment 2"], ["name", "Zach222"], ["created_at", "2023-07-11 17:35:36.696458"], ["updated_at", "2023-07-11 17:35:36.696458"], ["post_id", 4]]
---
	def create
		@comment = @post.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "This is a comment, now it is updated."], ["updated_at", "2023-07-11 17:29:10.662434"], ["id", 4]]
---
	def update
		@comment = Comment.find (params[:id])
		@comment.update(comment_params)