app/controllers/pages_controller.rb

	def index
		@pages = Page.all
---
SELECT "pages".* FROM "pages" ORDER BY "pages"."id" ASC LIMIT ?  [["LIMIT", 1]]

	def create

		@page.save
---
INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My Bio"], ["body", "I am a Sys admin"], ["slug", "bio"], ["created_at", "2023-06-29 02:29:12.865696"], ["updated_at", "2023-06-29 02:29:12.865696"]]

	def update

		@page.update(page_params)
---
UPDATE "pages" SET "title" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "Title 51"], ["updated_at", "2023-06-30 04:03:26.199764"], ["id", 5]]

	def destroy

		@page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 5]]